파일 크기로 중복을 추정.
이미지 비교는 코드가 복잡해서 구현 안함.

In [1]:
import os
import pandas as pd

In [2]:
classes = sorted([i for i in os.listdir('./original_pictures') if i[0] is not '.' if os.path.isdir('./original_pictures/'+i)])
classes

['01_nakseong',
 '02_scuba',
 '03_osteria',
 '04_hou_skewer',
 '05_gravy',
 '06_jungga',
 '07_edong_gan',
 '08_hwanyeo',
 '09_badarang',
 '10_sushi_mura',
 '11_ugo',
 '12_kingsjokbal']

In [3]:
#동일한 크기를 갖는 파일 목록
dup_photo = pd.DataFrame(columns=['filename', 'size'])
for i in classes:
    photo_list = os.listdir('./original_pictures/'+i)
    photo_size = [os.path.getsize('./original_pictures/'+i+'/'+x) for x in photo_list]
    photo = pd.DataFrame({'filename':photo_list, 'size':photo_size})
    if len(photo) != len(set(photo_size)):#중복된 사이즈가 있을때
        temp = pd.DataFrame(photo['size'].value_counts()>1)
        dup_size = list(temp[temp['size']==True].index)
        for j in range(len(dup_size)):
            dup_photo = pd.concat([dup_photo, photo[photo['size']==dup_size[j]]])
dup_photo.reset_index(drop=True, inplace=True)
dup_photo['path'] = './original_pictures/'+dup_photo.filename.str.split('_').str[0]+'_'+dup_photo.filename.str.split('_').str[1]+'/'

In [4]:
dup_photo

                    filename    size                                 path
0       01_nakseong_0141.jpg  134532     ./original_pictures/01_nakseong/
1       01_nakseong_0320.jpg  134532     ./original_pictures/01_nakseong/
2          02_scuba_0146.jpg  307042        ./original_pictures/02_scuba/
3          02_scuba_0167.jpg  307042        ./original_pictures/02_scuba/
4          02_scuba_0217.jpg  132803        ./original_pictures/02_scuba/
..                       ...     ...                                  ...
164          11_ugo_0400.jpg   44827          ./original_pictures/11_ugo/
165  12_kingsjokbal_0005.jpg  123653  ./original_pictures/12_kingsjokbal/
166  12_kingsjokbal_0030.jpg  123653  ./original_pictures/12_kingsjokbal/
167  12_kingsjokbal_0064.jpg  141798  ./original_pictures/12_kingsjokbal/
168  12_kingsjokbal_0115.jpg  141798  ./original_pictures/12_kingsjokbal/

[169 rows x 3 columns]

In [5]:
uniq = dup_photo[['size', 'path']].drop_duplicates().reset_index(drop=True)
uniq.head()

     size                              path
0  134532  ./original_pictures/01_nakseong/
1  307042     ./original_pictures/02_scuba/
2  132803     ./original_pictures/02_scuba/
3  124489     ./original_pictures/02_scuba/
4  102436     ./original_pictures/02_scuba/

In [6]:
import cv2
from skimage.measure import compare_ssim

In [7]:
temp = dup_photo[(dup_photo['size']==uniq['size'][0]) & (dup_photo['path']==uniq['path'][0])]
temp

               filename    size                              path
0  01_nakseong_0141.jpg  134532  ./original_pictures/01_nakseong/
1  01_nakseong_0320.jpg  134532  ./original_pictures/01_nakseong/

In [8]:
img = cv2.imread(temp['path'][0]+temp['filename'][0])

In [9]:
cv2.imshow(img)